cask_args appdir: '/Applications'
# install packages

brew 'git'
brew 'git-spice'
brew 'bash-completion'


brew 'direnv'
brew 'stow'
brew 'uv'
brew 'gh'
brew 'zig'
brew 'docker'
brew 'colima'
brew 'emacs'
brew 'python3'

brew 'pre-commit'

cask '1password-cli'
cask 'rectangle'
