cask_args appdir: '/Applications'
# install packages

brew 'git'
brew 'git-spice'
brew 'bash-completion'


brew 'direnv'
brew 'stow'
brew 'ripgrep'
brew 'uv'
brew 'gh'
brew 'zig'
brew 'docker'
brew 'colima'
brew 'emacs'
brew 'python3'

brew 'pre-commit'

cask '1password'
cask '1password-cli'
cask 'rectangle-pro'
cask 'notion'

cask 'ghostty'
cask 'zed'

cask 'claude'
cask 'claude-code'
cask 'chatgpt'
cask 'warp'
cask 'ollama-app'
cask 'discord'
cask 'whatsapp'

# For Githubpages
brew 'chruby'
brew 'ruby-install'
